# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'
tap 'jesseduffield/lazygit/lazygit'

# Binaries
brew 'awscli'
brew 'fzf'
brew 'gh'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas'

# Development
brew 'adr-tools'
brew 'composer'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'openjdk@11'
brew 'php'
brew 'php@7.3'
brew 'php@7.2'
brew 'postgresql'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask 'appcleaner'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'hey'
cask 'intellij-idea'
cask 'iterm2'
cask 'java'
cask 'karabiner-elements'
cask 'notion'
cask 'phpstorm'
cask 'sequel-pro'
cask 'skype'
cask 'skype-for-business'
cask 'slack'
cask 'sourcetree'
cask 'spectacle'
cask 'spotify'
cask 'tableplus'
cask 'whatsapp'
cask 'zoomus'

# Fonts
cask 'font-jetbrains-mono'

# Mac App Store
mas 'Bear', id: 1091189122
